# Лицензия Apache
Версия 2.0, январь 2004 года
http://www.apache.org/licenses

## УСЛОВИЯ И ОГРАНИЧЕНИЯ ДЛЯ ИСПОЛЬЗОВАНИЯ, ВОСПРОИЗВЕДЕНИЯ И РАСПРОСТРАНЕНИЯ
### 1. Определения

«Лицензия» означает условия и положения для использования, воспроизведения и распространения, определенные пунктами со 2 по 9 данного документа.

«Лицензиар» означает владельца авторского права либо юридическое лицо, уполномоченное владельцем авторского права предоставлять данную Лицензию.

«Юридическое лицо» означает объединение действующего лица и всех других лиц, которые контролируются им, контролируют его или находятся под общим контролем с ним. Для целей настоящего определения «контроль» означает: (i) прямую или косвенную возможность определять направление деятельности такого лица путем заключения договора или иным образом; (ii) владение более чем половиной выпущенных акций; (iii) выгодное владение таким лицом.

«Вы» (или «Ваш») означает физическое или юридическое лицо, использующее разрешения, предоставленные данной Лицензией.

«Исходная форма» означает предпочтительную форму для внесения изменений, включая, помимо прочего, исходный код программного обеспечения, документацию и конфигурационные файлы.

«Объектная форма» означает любую форму, полученную в результате механического преобразования или трансляции Исходной формы, включая, помимо прочего, объектный код, созданную документацию и преобразование в другие форматы носителей информации.

«Работа» означает произведение, являющееся объектом авторского права, находящееся в Исходной или Объектной форме, доступное согласно настоящей Лицензии, как указано в уведомлении об авторских правах, включенном в работу или прикрепленном к ней (пример уведомления приведен ниже).

«Производные работы» означают любое произведение, основанное на (или производное от) Работы и для которого редакционные изменения, аннотации, дополнения или иные модификации представляют собой оригинальное произведение авторского права. Для целей этой Лицензии Производными работами не считаются произведения, остающиеся отделимыми от Работ или просто связывающиеся (или объединяемые по имени) с интерфейсами Работ и их Производных работ.

«Вклад» означает любое произведение, являющееся объектом авторского права, включая первоначальную версию Работы и все внесенные в нее изменения или добавления, а также Производные работы, специально представленные Лицензиару автором или физическим/юридическим лицом, уполномоченным представлять автора. Под представлением здесь подразумевается любая электронная, устная или письменная коммуникация, направленная Лицензиару или его представителям, включая коммуникации через электронные почтовые рассылки, системы контроля версий кода и системы отслеживания проблем, управляемые Лицензиаром или от его имени, предназначенные для обсуждения и улучшения Работы, за исключением явно обозначенной автором как "Не вклад".

«Участник» означает Лицензиара и любое физическое или юридическое лицо, от имени которого был представлен Вклад, принятый Лицензиаром и впоследствии включенный в Работу.

### 2. Предоставление лицензии на авторское право. Принимая во внимание условия и ограничения данной Лицензии, каждый Участник предоставляет Вам бессрочную, всемирную, безвозмездную, бесплатную, безотзывную лицензию на авторские права воспроизводить, создавать Производные работы, публично демонстрировать, исполнять, предоставлять суб-лицензии и распространять Работу и такие Производные работы в Исходной или Объектной формах.

### 3. Предоставление патентной лицензии. Каждый Участник предоставляет Вам бессрочную, всемирную, безвозмездную, бесплатную, безотзывную (за исключением случаев, указанных в данном разделе) патентную лицензию производить, заказывать производство, использовать, предлагать к продаже, продавать, импортировать и передавать Работу, при условии что такая лицензия распространяется только на те патентные требования, предоставляемые Участником, которые нарушаются исключительно его Вкладом или комбинацией его Вклада с Работой, в которую он был включен. Если Вы инициируете судебное разбирательство против любого лица (включая встречные иски или контр-требования в судебном процессе), утверждая, что Работа или Вклад, включённый в Работу, представляет собой прямое или сопутствующее нарушение патента, то всякая патентная лицензия, предоставленная Вам согласно данной Лицензии относительно такой Работы, прекращает своё действие с даты подачи иска.

### 4. Распространение. Вы можете воспроизводить и распространять копии Работы или её Производных работ любыми средствами, с изменениями или без них, в Исходной или Объектной формах, при соблюдении следующих условий:

(a) Вы должны предоставить другим получателям Работы или Производных работ копию данной Лицензии;
(b) Вы обязаны обеспечить наличие заметных указаний в изменённых файлах о том, что Вы внесли изменения;
(c) Вы обязаны сохранять в Исходной форме любых Производных работ, которые Вы распространяете, все уведомления об авторских правах, патентах, товарных знаках и атрибуциях из Исходной формы Работы, исключая те уведомления, которые не относятся ни к одной части Производных работ;
(d) Если Работа включает файл «NOTICE», являющийся частью ее дистрибутива, тогда любые Производные работы, которые Вы распространяете, должны включать читаемую копию уведомлений об атрибутах, содержащихся в таком файле NOTICE, исключая те уведомления, которые не имеют отношения ни к одной части Производных работ, по крайней мере в одном из следующих мест: внутри файла NOTICE, распространяемого вместе с Производными работами; в документации или Исходном виде, если они предоставляются вместе с Производными работами; или в отображении, генерируемом Производными работами, где обычно появляются третьи стороны. Содержание файла NOTICE предназначено исключительно для информационных целей и не меняет условий Лицензии. Вы можете добавлять собственные уведомления об атрибутах в распространяемых Вами Производных работах рядом или в качестве дополнения к тексту NOTICE из Работы, при условии, что дополнительные уведомления об атрибутах нельзя интерпретировать как изменение Лицензии.

Вы можете добавить собственное уведомление об авторских правах к своим изменениям и предоставить дополнительные или отличающиеся лицензионные условия для использования, воспроизведения или распространения Ваших изменений или для любых таких Производных работ целиком, при условии, что Ваше использование, воспроизведение и распространение Работы в остальном соответствует условиям, изложенным в данной Лицензии.

### 5. Представление вкладов. За исключением случая, когда Вы прямо указали иное, любой Вклад, намеренно представленный Вами для включения в Работу Лицензиару, считается предоставленным на условиях и ограничениях данной Лицензии, без каких-либо дополнительных условий. Настоящим подтверждается, что ничто в настоящем документе не отменяет и не изменяет условий какого-либо отдельного лицензионного соглашения, которое Вы могли заключить с Лицензиаром касательно таких Вкладов.

### 6. Товарные знаки. Данная Лицензия не дает разрешение на использование фирменных наименований, товарных знаков, знаков обслуживания или названий продукции Лицензиара, кроме случаев, необходимых для разумного и обычного описания происхождения Работы и воспроизведения содержания файла NOTICE.

### 7. Отказ от гарантии. Если иное не предусмотрено применимым законодательством или письменно согласовано, Лицензиар предоставляет Работу (а каждый Участник предоставляет свои Вклады) «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ ЛЮБОГО РОДА, явных или подразумеваемых, включая, помимо прочего, какие-либо гарантии или условия владения, отсутствия нарушения прав третьих лиц, пригодности для продажи или пригодности для определённой цели. Вы самостоятельно несёте ответственность за определение целесообразности использования или распространения Работы и принимаете на себя все риски, связанные с использованием разрешений, предусмотренных данной Лицензией.

### 8. Ограничение ответственности. Ни при каких обстоятельствах и ни по какой правовой теории, будь то деликт (включая халатность), договор или иначе, если это не требуется действующим законодательством (например, умышленное грубое пренебрежение обязанностями) или письменно согласовано, никакой Участник не будет нести ответственность перед Вами за ущерб, включая прямой, косвенный, случайный или последующий ущерб любого характера, возникший вследствие данной Лицензии или в связи с использованием или невозможностью использования Работы (включая, помимо прочего, ущерб, связанный с потерей деловой репутации, остановкой работы, сбоем компьютера или иной коммерческой деятельностью или убытками), даже если данный Участник был предупреждён о возможности подобного ущерба.

### 9. Принятие дополнительной ответственности или гарантий. При перераспределении Работы или её Производных работ Вы вправе предложить и взимать плату за принятие обязательств по поддержке, гарантиям, компенсации убытков или иных обязательствах и/или правам, совместимых с условиями данной Лицензии. Однако принимая подобные обязательства, Вы действуете исключительно от своего собственного имени и на свой собственный риск, не от имени какого-либо другого Участника, и только если Вы согласны компенсировать убытки, защищать интересы и освобождать каждого Участника от ответственности за любые претензии, предъявляемые такому Участнику в связи с принятием Вами подобных гарантий или дополнительной ответственности.

Copyright 2026 Danil Games

Лицензирована согласно Apache License, Версии 2.0 («Лицензия»);
вы не можете использовать этот файл, не соблюдая Лицензию.
Вы можете получить копию Лицензии по адресу

    http://www.apache.org/licenses/LICENSE-2.0

Если не требуется действующим законодательством или письменно согласовано,
программное обеспечение, распространяемое согласно Лицензии, предоставляется
на основе принципа «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ ЛЮБОГО РОДА,
явных или подразумеваемых. Ознакомьтесь с Лицензией для получения конкретной
информации о разрешении и ограничениях, связанных с правами.
